// 假设你正在爬楼梯。需要 n 阶你才能到达楼顶。
// 每次你可以爬 1 或 2 个台阶。你有多少种不同的方法可以爬到楼顶呢？

// 示例 1
// 输入：n = 2
// 输出：2
// 解释：有两种方法可以爬到楼顶。
// 1. 1 阶 + 1 阶
// 2. 2 阶

// 示例 2
// 输入：n = 3
// 输出：3
// 解释：有三种方法可以爬到楼顶。
// 1. 1 阶 + 1 阶 + 1 阶
// 2. 1 阶 + 2 阶
// 3. 2 阶 + 1 阶

function climbStairs(n: number): number {
  // 方法：动态规划
  // * 时间复杂度：O(n)
  // * 空间复杂度：O(n)
  // 动规五部曲
  // 1. 确定dp数组以及下标的含义: dp[i] 表示爬到第 i 阶的方法数
  // 2. 确定递推公式: dp[i] = dp[i - 1] + dp[i - 2]
  // 3. dp数组如何初始化: dp[0] = 1, dp[1] = 1
  // 4. 确定遍历顺序: 从前往后遍历
  // 5. 举例推导dp数组:
  const dp = Array(n + 1).fill(0);
  dp[0] = 1;
  dp[1] = 1;
  for (let i = 2; i <= n; i++) {
    dp[i] = (dp[i - 1] + dp[i - 2]) % 1000000007;
  }
  return dp[n];
}

export {};
